jpnorair/OpenTag/include/board/stm32l1xx/board_Jupiter_R1.h
/* Copyright 2013-2014 JP Norair
  *
  * Licensed under the OpenTag License, Version 1.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  * http://www.indigresso.com/wiki/doku.php?id=opentag:license_1_0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  */
/**
  * @file       /board/stm32l1xx/board_Jupiter_R1.h
  * @author     JP Norair
  * @version    R100
  * @date       29 Aug 2014
  * @brief      Board Configuration for Haystack Jupiter DK
  * @ingroup    Platform
  *
  * Do not include this file, include OT_platform.h
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them.
  *
  ******************************************************************************
  */
  

#ifndef __board_Jupiter_R1_H
#define __board_Jupiter_R1_H

/// MCU definition for the board must be the first thing
#define __STM32L151CB__


#include <app/app_config.h>
#include <platform/hw/STM32L1xx_config.h>
#include <platform/interrupts.h>

#ifdef __NULL_RADIO__
#   include <io/null_radio/config.h>
#else
#   include <io/spirit1/config.h>
#endif



/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED




/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * Jupiter R1 assumes a 50% antenna (-3dB) with 2dB insertion loss
  */
#define RF_PARAM_BAND   433
#define RF_HDB_ATTEN    10       //Half dB attenuation (units = 0.5dB), used to scale TX power
#define RF_HDB_RXATTEN  6
#define RF_RSSI_OFFSET  RF_HDB_RXATTEN        //Offset applied to RSSI calculation




/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capabilities of the STM32L variants on this board/build
  *
  * On this board, the Jupiter DK, you can use USB or UART for MPipe
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED                            // Allows usage of MF-HF clock boosting
#define MCU_CONFIG_MAPEEPROM            DISABLED
#define MCU_CONFIG_MPIPECDC             ENABLED                             // USB-CDC MPipe implementation
#define MCU_CONFIG_MPIPEUART            (MCU_CONFIG_MPIPECDC != ENABLED)    // UART MPipe Implementation
#define MCU_CONFIG_MPIPEI2C             DISABLED                            // I2C MPipe Implementation
#define MCU_CONFIG_MEMCPYDMA            ENABLED                             // MEMCPY DMA should be lower priority than MPIPE DMA
#define MCU_CONFIG_USB                  (MCU_CONFIG_MPIPECDC == ENABLED)
#define MCU_CONFIG_VOLTLEVEL            2  // 3=1.2, 2=1.5V, 1=1.8V





/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  For this configuration, 
  * Veelite is put into FLASH.
  *
  * The STM32L uses 256 byte Flash pages and 4KB Flash sectors.  Therefore, it
  * is best to allocate the FS in Flash on 4KB boundaries because this is the 
  * resolution that can be write protected (or, as with FS, *NOT* write 
  * protected).  Best practice with STM32 chips is to put the FS at the back of
  * of the Flash space because this seems to work best with the debugger HW.
  */

// You can comment-out these if you want to use chip defaults
#ifndef SRAM_SIZE
#   define SRAM_SIZE            (16*1024)
#endif
#ifndef EEPROM_SIZE
#   define EEPROM_SIZE          (4*1024)
#endif
#ifndef FLASH_SIZE
#   define FLASH_SIZE           (64*1024)
#endif


// Using EEPROM: Pages figure is irrelevant
#define FLASH_NUM_PAGES         (FLASH_SIZE/FLASH_PAGE_SIZE)
#define FLASH_FS_ADDR           (EEPROM_START_ADDR)
#define FLASH_FS_PAGES          0
#define FLASH_FS_FALLOWS        0 
#define FLASH_FS_ALLOC          (EEPROM_SIZE) 








/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. Two buttons are supported, but only if MPIPE is not enabled.
  *    <LI> SW1: multiplexed with TX/SCL </LI>
  *    <LI> SW2: multiplexed with RX/SDA </LI>
  * 
  * 2. Two LEDs can be supported.
  *    <LI> TRIG1 (typically Orange LED) is multiplexed on TEST pin.  TEST pin
  *         is a feature of the HayTag, and it has no special purpose in HW. </LI>
  *    <LI> TRIG2 (typically Green LED) is multiplexed on the TRACE-SWO pin.
  *         If you are using an SWO Tracer, you would need to disable TRIG2.
  *         (editorial note: I have never used or even seen an SWO Tracer) </LI>
  *
  * 3. MPIPE can support UART TX/RX (no flow control) or I2C.  In either case,
  *    a break character can be transmitted by the client ahead of the packet 
  *    in order to wakeup the system.  Assume that 20us is needed between the
  *    client-TX falling edge and start-bit rising edge.
  *
  * 4. The Debug and Upload interface is SWD.  There is no serial bootloader
  *    capability.  (Editorial Note: A ST-Link-V2 has SWD and a low price of
  *    US$25.  It can work with OpenOCD, so the toolchain is still very cheap.)
  * 
  * 5. The SPIRIT1 SPI benefits from the highest speed clock up to 20 MHz.
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      BOARD_FEATURE_MPIPE         // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_DIRECT      DISABLED //BOARD_FEATURE_MPIPE
#define BOARD_FEATURE_MPIPE_BREAK       BOARD_FEATURE_MPIPE                     // Send/receive leading break for wakeup
#define BOARD_FEATURE_MPIPE_CS          DISABLED                    // Chip-Select / DTR wakeup control
#define BOARD_FEATURE_MPIPE_FLOWCTL     DISABLED                    // RTS/CTS style flow control 

#define BOARD_FEATURE_LFXTAL            ENABLED                 // LF XTAL used as Clock source
#define BOARD_FEATURE_HFXTAL            DISABLED                // HF XTAL used as Clock source
#define BOARD_FEATURE_HFBYPASS          MCU_CONFIG_USB
#define BOARD_FEATURE_RFXTAL            ENABLED                 // XTAL for RF chipset
#define BOARD_FEATURE_RFXTALOUT         MCU_CONFIG_USB
#define BOARD_FEATURE_PLL               MCU_CONFIG_USB
#define BOARD_FEATURE_STDSPEED          (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_FULLSPEED         ENABLED
#define BOARD_FEATURE_FULLXTAL          DISABLED
#define BOARD_FEATURE_FLANKSPEED        ((MCU_CONFIG_MULTISPEED == ENABLED) || (MCU_CONFIG_USB != ENABLED))
#define BOARD_FEATURE_FLANKXTAL         MCU_CONFIG_USB
#define BOARD_FEATURE_INVERT_TRIG1      DISABLED
#define BOARD_FEATURE_INVERT_TRIG2      DISABLED

#define BOARD_PARAM_TRIGS               2
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002
#define BOARD_PARAM_MFHz                4200000
#define BOARD_PARAM_MFmult              1                       // Main CLK = HFHz * (MFmult/MFdiv)
#define BOARD_PARAM_MFdiv               1
#define BOARD_PARAM_MFtol               0.02
#define BOARD_PARAM_HFHz                16000000
#define BOARD_PARAM_HFtol               0.02
#define BOARD_PARAM_HFppm               20000
#define BOARD_PARAM_RFHz                48000000
#define BOARD_PARAM_RFdiv               6
#define BOARD_PARAM_RFout               (BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)
#define BOARD_PARAM_RFtol               0.00003
#define BOARD_PARAM_PLLout              96000000
#define BOARD_PARAM_PLLmult             (BOARD_PARAM_PLLout/BOARD_PARAM_RFout)
#define BOARD_PARAM_PLLdiv              3
#define BOARD_PARAM_PLLHz               (BOARD_PARAM_PLLout/BOARD_PARAM_PLLdiv)

#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// SWD Interface (HayTag has SWD but no JTAG)
// The SWO (Trace) pin is available, but not often used
#define BOARD_SWDIO_PORT                GPIOA
#define BOARD_SWDIO_PINNUM              13
#define BOARD_SWDIO_PIN                 (1<<13)
#define BOARD_SWDCLK_PORT               GPIOA
#define BOARD_SWDCLK_PINNUM             14
#define BOARD_SWDCLK_PIN                (1<<14)
#define BOARD_TRACESWO_PORTNUM          1
#define BOARD_TRACESWO_PORT             GPIOB
#define BOARD_TRACESWO_PINNUM           (1<<3)
#define BOARD_TRACESWO_PIN              3

// SW1 is implemented on the TRACE Pin, active high
#define BOARD_SW1_PORTNUM               1                   // Port B
#define BOARD_SW1_PORT                  GPIOB
#define BOARD_SW1_PINNUM                3
#define BOARD_SW1_PIN                   (1<<3)
#define BOARD_SW1_POLARITY              1
#define BOARD_SW1_PULLING               1

// TEST0, TEST1 pins are usually outputs but they could be pull-up inputs also
#define BOARD_TEST0_PORTNUM             1                   // Port B
#define BOARD_TEST0_PORT                GPIOB
#define BOARD_TEST0_PINNUM              4
#define BOARD_TEST0_PIN                 (1<<4)
#define BOARD_TEST0_POLARITY            0
#define BOARD_TEST0_PULLING             1
#define BOARD_TEST1_PORTNUM             1                   // Port B
#define BOARD_TEST1_PORT                GPIOB
#define BOARD_TEST1_PINNUM              5
#define BOARD_TEST1_PIN                 (1<<5)
#define BOARD_TEST1_POLARITY            0
#define BOARD_TEST1_PULLING             1

// LED interface is implemented active-high (push) on PA0 & PA1
#define BOARD_LEDG_PORTNUM              0                   // Port A
#define BOARD_LEDG_PORT                 GPIOA
#define BOARD_LEDG_PINNUM               1
#define BOARD_LEDG_PIN                  (1<<1)
#define BOARD_LEDG_POLARITY             1
#define BOARD_LEDO_PORTNUM              0                   // Port A
#define BOARD_LEDO_PORT                 GPIOA
#define BOARD_LEDO_PINNUM               0
#define BOARD_LEDO_PIN                  (1<<0)
#define BOARD_LEDO_POLARITY             1

// SPIRIT1 RF interface
#define BOARD_RFGPIO_PORTNUM            1
#define BOARD_RFGPIO_PORT               GPIOB
#define BOARD_RFGPIO_0PINNUM            0
#define BOARD_RFGPIO_1PINNUM            1
#define BOARD_RFGPIO_2PINNUM            2
#define BOARD_RFCTL_PORTNUM             0
#define BOARD_RFCTL_PORT                GPIOA
#define BOARD_RFCTL_SDNPINNUM           2
#define BOARD_RFCTL_3PINNUM             3
#define BOARD_RFGPIO_0PIN               (1<<BOARD_RFGPIO_0PINNUM)
#define BOARD_RFGPIO_1PIN               (1<<BOARD_RFGPIO_1PINNUM)
#define BOARD_RFGPIO_2PIN               (1<<BOARD_RFGPIO_2PINNUM)
#define BOARD_RFCTL_3PIN                (1<<BOARD_RFCTL_3PINNUM)
#define BOARD_RFCTL_SDNPIN              (1<<BOARD_RFCTL_SDNPINNUM)
#define BOARD_RFSPI_ID                  1       //SPI1
#define BOARD_RFSPI_PORTNUM             0       //Port A
#define BOARD_RFSPI_PORT                GPIOA
#define BOARD_RFSPI_MOSIPINNUM          7
#define BOARD_RFSPI_MISOPINNUM          6
#define BOARD_RFSPI_SCLKPINNUM          5
#define BOARD_RFSPI_CSNPINNUM           4
#define BOARD_RFSPI_MOSIPIN             (1<<BOARD_RFSPI_MOSIPINNUM)
#define BOARD_RFSPI_MISOPIN             (1<<BOARD_RFSPI_MISOPINNUM)
#define BOARD_RFSPI_SCLKPIN             (1<<BOARD_RFSPI_SCLKPINNUM)
#define BOARD_RFSPI_CSNPIN              (1<<BOARD_RFSPI_CSNPINNUM)

