jpnorair/OpenTag/include/board/stm32l1xx/board_Jupiter_R1.h
// Main serial connections, used at least by MPIPE
#define BOARD_I2C_PORTNUM           1
#define BOARD_I2C_PORT              GPIOB
#define BOARD_I2C_ID                2
#define BOARD_I2C_SCLPINNUM         10
#define BOARD_I2C_SDAPINNUM         11
#define BOARD_I2C_SCLPIN            (1<<BOARD_I2C_SCLPINNUM)
#define BOARD_I2C_SDAPIN            (1<<BOARD_I2C_SDAPINNUM)
#define BOARD_UART_PORTNUM          0
#define BOARD_UART_PORT             GPIOA
#define BOARD_UART_ID               1
#define BOARD_UART_TXPINNUM         9
#define BOARD_UART_RXPINNUM         10
#define BOARD_UART_RTSPINNUM        11
#define BOARD_UART_CTSPINNUM        12
#define BOARD_UART_DTRPINNUM        BOARD_UART_CTSPINNUM
#define BOARD_UART_TXPIN            (1<<BOARD_UART_TXPINNUM)
#define BOARD_UART_RXPIN            (1<<BOARD_UART_RXPINNUM)
#define BOARD_UART_RTSPIN           (1<<BOARD_UART_RTSPINNUM)
#define BOARD_UART_CTSPIN           (1<<BOARD_UART_CTSPINNUM)
#define BOARD_UART_DTRPIN           (1<<BOARD_UART_DTRPINNUM)
#define BOARD_USB_PORTNUM           0
#define BOARD_USB_PORT              GPIOA
#define BOARD_USB_DMPINNUM          11
#define BOARD_USB_DPPINNUM          12
#define BOARD_USB_DMPIN             (1<<BOARD_USB_DMPINNUM)
#define BOARD_USB_DPPIN             (1<<BOARD_USB_DPPINNUM)
#define BOARD_SRES_PORTNUM          0
#define BOARD_SRES_PORT             GPIOA
#define BOARD_SRES_PINNUM           15
#define BOARD_SRES_PIN              (1<<BOARD_SRES_PINNUM)
#define BOARD_USEN_PORTNUM          2
#define BOARD_USEN_PORT             GPIOC
#define BOARD_USEN_PINNUM           13
#define BOARD_USEN_PIN              (1<<BOARD_USEN_PINNUM)

// ADC Analog inputs
#define BOARD_ADC_PORTNUM               1
#define BOARD_ADC_PORT                  GPIOB
#define BOARD_ADC_APINNUM               12
#define BOARD_ADC_BPINNUM               13
#define BOARD_ADC_CPINNUM               14
#define BOARD_ADC_DPINNUM               15
#define BOARD_ADC_APIN                  (1<<BOARD_ADC_APINNUM)
#define BOARD_ADC_BPIN                  (1<<BOARD_ADC_BPINNUM)
#define BOARD_ADC_CPIN                  (1<<BOARD_ADC_CPINNUM)
#define BOARD_ADC_DPIN                  (1<<BOARD_ADC_DPINNUM)
#define BOARD_ADC_ACHAN                 18
#define BOARD_ADC_BCHAN                 19
#define BOARD_ADC_CCHAN                 20
#define BOARD_ADC_DCHAN                 21

// MCO Output, which could also be a GPIO
#define BOARD_MCO_PORTNUM               0
#define BOARD_MCO_PORT                  GPIOA
#define BOARD_MCO_PINNUM                8
#define BOARD_MCO_PIN                   (1<<BOARD_MCO_PINNUM)

// GPIO Bus: available pins are 3-9
// - Pins 0-2 are radio transceiver inputs, which you can certainly read if you want
// - Pin 3 is the TRACE PIN, so avoid using it if you can
// - Pins 10-11 are used with the  I2C, which are alternate function by default
// - Pins 12-15 are the ADC inputs
#define BOARD_IOBUS_PORTNUM             1
#define BOARD_IOBUS_PORT                GPIOB
#define BOARD_IOBUS_PINMASK             (0x01F8)

// I2C Sensor Bus (Multiplexed on IOBUS B6:7)
#define BOARD_SBUSI2C_PORTNUM           1
#define BOARD_SBUSI2C_PORT              GPIOB
#define BOARD_SBUSI2C_ID                1
#define BOARD_SBUSI2C_SCLPINNUM         6
#define BOARD_SBUSI2C_SDAPINNUM         7
#define BOARD_SBUSI2C_SCLPIN            (1<<BOARD_SBUSI2C_SCLPINNUM)
#define BOARD_SBUSI2C_SDAPIN            (1<<BOARD_SBUSI2C_SDAPINNUM)

// Timer IO: these are multiplexed onto the IOBUS
#define BOARD_TIMA_PORTNUM              1
#define BOARD_TIMA_PORT                 GPIOB
#define BOARD_TIMA_ID                   3
#define BOARD_TIMA                      TIM3
#define BOARD_TIMA_CHANS                2
#define BOARD_TIMA_1CHAN                1
#define BOARD_TIMA_2CHAN                2
#define BOARD_TIMA_1PINNUM              4
#define BOARD_TIMA_2PINNUM              5
#define BOARD_TIMA_1PIN                 (1<<BOARD_TIMA_1PINNUM)
#define BOARD_TIMA_2PIN                 (1<<BOARD_TIMA_2PINNUM)
#define BOARD_TIMB_PORTNUM              1
#define BOARD_TIMB_PORT                 GPIOB
#define BOARD_TIMB_ID                   4
#define BOARD_TIMB                      TIM4
#define BOARD_TIMB_CHANS                4
#define BOARD_TIMB_1CHAN                1
#define BOARD_TIMB_2CHAN                2
#define BOARD_TIMB_3CHAN                3
#define BOARD_TIMB_4CHAN                4
#define BOARD_TIMB_1PINNUM              6
#define BOARD_TIMB_2PINNUM              7
#define BOARD_TIMB_3PINNUM              8
#define BOARD_TIMB_4PINNUM              9
#define BOARD_TIMB_1PIN                 (1<<BOARD_TIMB_1PINNUM)
#define BOARD_TIMB_2PIN                 (1<<BOARD_TIMB_2PINNUM)
#define BOARD_TIMB_3PIN                 (1<<BOARD_TIMB_3PINNUM)
#define BOARD_TIMB_4PIN                 (1<<BOARD_TIMB_4PINNUM)
#define BOARD_TIM
#define BOARD_TIMC_PORTNUM              1
#define BOARD_TIMC_PORT                 GPIOB
#define BOARD_TIMC_ID                   10
#define BOARD_TIMC                      TIM10
#define BOARD_TIMC_CHANS                1
#define BOARD_TIMC_1CHAN                1
#define BOARD_TIMC_1PINNUM              8
#define BOARD_TIMC_1PIN                 (1<<BOARD_TIMC_1PINNUM)
#define BOARD_TIMD_PORTNUM              1
#define BOARD_TIMD_PORT                 GPIOB
#define BOARD_TIMD_ID                   11
#define BOARD_TIMD                      TIM11
#define BOARD_TIMD_CHANS                1
#define BOARD_TIMD_1CHAN                1
#define BOARD_TIMD_1PINNUM              9
#define BOARD_TIMD_1PIN                 (1<<BOARD_TIMD_1PINNUM)




/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag STM32L platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  */
// DMA is used in MEMCPY and thus it could be needed at any time during
// active runtime.  So, the active-clock must be enabled permanently.

