jpnorair/OpenTag/include/board/stm32l1xx/board_Jupiter_R1.h
#if (MCU_CONFIG_MEMCPYDMA)
#   define _DMACLK_N    RCC_AHBENR_DMA1EN
#else
#   define _DMACLK_N    0
#   define _DMACLK_DYNAMIC
#endif

//Flash should be enabled unless you seriously modify OpenTag.
#define _FLITFCLK_N      RCC_AHBENR_FLITFEN

//The built-in CRC engine is rarely used, start disabled
#define _CRCCLK_N        0   //RCC_AHBENR_CRCEN

// This board uses GPIO A and B, but not C.  C is used for the 32 kHz OSC.
#define _GPIOCLK_SU      (RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN | RCC_AHBENR_GPIOHEN)
#define _GPIOCLK_N       (RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN)

// DMA will be enabled in Sleep on demand by the device driver.  By default
// it is disabled in sleep
#define _DMACLK_LP   RCC_AHBLPENR_DMA1LPEN
//#define _DMACLK_DYNAMIC_LP

// SRAM should always be clocked during SLEEP
#define _SRAMCLK_LP      RCC_AHBLPENR_SRAMLPEN

// FLASH needs to be clocked during LP modes, such as if you are sending
// constant data from Flash across a DMA+Peripheral.  We assume this is the
// case.  In any case, the supply current hit is negligible.
#define _FLITFCLK_LP     RCC_AHBLPENR_FLITFLPEN

// HW CRC32 engine is never used in sleep, or much at all, so fuck it
#define _CRCCLK_LP       0       //RCC_AHBLPENR_CRCLPEN

// GPIOA and B are also enabled in Low-Power Modes
#define _GPIOCLK_LP      (RCC_AHBLPENR_GPIOALPEN | RCC_AHBLPENR_GPIOBLPEN | RCC_AHBLPENR_GPIOCLPEN)


#define _AHBENR_STARTUP  (_DMACLK_N | _FLITFCLK_N | _CRCCLK_N | _GPIOCLK_SU)
#define _AHBENR_RUNTIME  (_DMACLK_N | _FLITFCLK_N | _CRCCLK_N | _GPIOCLK_N)


//@note BOARD Macro for Peripheral Clock initialization at startup
static inline void BOARD_PERIPH_INIT(void) {
    //1. AHB Clock Setup for Active Mode
    RCC->AHBENR    = _AHBENR_STARTUP;

    // 1b. AHB Clock Setup for Sleep Mode
    RCC->AHBLPENR  = (_DMACLK_LP | _SRAMCLK_LP | _FLITFCLK_LP | _CRCCLK_LP | _GPIOCLK_LP);

    // 2. APB2 Clocks in Active Mode.  APB2 is the high-speed peripheral bus.  
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  SYSCFG and the Chronograph Timer
    // (here, TIM9) are the exceptions.
    // USART1, SPI1, ADC1, TIM11, TIM10, TIM9, SYSCFG.
#   ifdef __DEBUG__
    RCC->APB2ENR   = (RCC_APB2ENR_TIM9EN | RCC_APB2ENR_SYSCFGEN);
#   else
    RCC->APB2ENR   = (RCC_APB2ENR_TIM10EN | RCC_APB2ENR_SYSCFGEN);
#   endif

    // 3. APB1 Clocks in Active Mode.  APB1 is the low-speed peripheral bus.
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  PWR is the exception.
    // COMP, DAC, PWR, USB, I2C2, I2C1, USART3, USART2, SPI2, WWDG, LCD, TIM7,
    // TIM6, TIM4, TIM3, TIM2
    RCC->APB1ENR   = (RCC_APB1ENR_PWREN); 
}



//@note BOARD Macro for DMA peripheral enabling
static inline void BOARD_DMA_CLKON(void) {
#ifdef _DMACLK_DYNAMIC
    // DMA is not enabled for normal mode by default, so enable it
    RCC->AHBENR    |= RCC_AHBENR_DMA1EN;
#endif
#ifdef _DMACLK_DYNAMIC_LP
    // DMA is not enabled for low-power mode by default, so enable it
    //RCC->AHBLPENR  |= RCC_AHBLPENR_DMA1LPEN;
#endif
}

static inline void BOARD_DMA_CLKOFF(void) {
#ifdef _DMACLK_DYNAMIC
    // DMA is not enabled for normal mode by default, so disable it
    RCC->AHBENR    &= ~RCC_AHBENR_DMA1EN;
#endif
#ifdef _DMACLK_DYNAMIC_LP
    // DMA is not enabled for low-power mode by default, so disable it
    //RCC->AHBLPENR  &= ~RCC_AHBLPENR_DMA1LPEN;
#endif
}



///@note BOARD Macro for EXTI initialization.  See also EXTI macros at the
///      bottom of the page.
static inline void BOARD_EXTI_STARTUP(void) {
    // EXTI0-3: RFGPIO0, RFGPIO1, RFGPIO2, TRACESWO/IOBUS_3
    SYSCFG->EXTICR[0]  |= (BOARD_RFGPIO_PORTNUM << 0) \
                        | (BOARD_RFGPIO_PORTNUM << 4) \
                        | (BOARD_RFGPIO_PORTNUM << 8) \
                        | (BOARD_IOBUS_PORTNUM << 12);
    
    // EXTI4-7: IOBUS_4, IOBUS_5, IOBUS_6, IOBUS_7
    SYSCFG->EXTICR[1]  |= (BOARD_IOBUS_PORTNUM << 0) \
                        | (BOARD_IOBUS_PORTNUM << 4) \
                        | (BOARD_IOBUS_PORTNUM << 5) \
                        | (BOARD_IOBUS_PORTNUM << 12);
    
    // EXTI8-11: IOBUS_8, IOBUS_9, UART RX-Break, I2C RX-Break
    SYSCFG->EXTICR[2]  |= (BOARD_IOBUS_PORTNUM << 0) \
                        | (BOARD_IOBUS_PORTNUM << 4) \
                        | (BOARD_UART_PORTNUM << 8) \
                        | (BOARD_I2C_PORTNUM << 12);
    
    // EXTI12-15: CTS/DTR (if UART), USBSENSE, USER_B14, SRES
    SYSCFG->EXTICR[3]  |= (BOARD_UART_PORTNUM << 0) \
                        | (BOARD_USEN_PORTNUM << 4) \
                        | (BOARD_IOBUS_PORTNUM << 8) \
                        | (BOARD_SRES_PORTNUM << 12);
}



///@note BOARD Macro for initializing GPIO ports at startup, pursuant to the
///      connections in the schematic of this board.  This funciotn
static inline void BOARD_PORT_STARTUP(void) {  
    /// Initialize ports/pins exclusively used within this platform module.
/// A. Trigger Pins
/// B. Random Number ADC pins: A Zener can be used to generate noise.
       /// Configure Port A IO.  
    /// Port A is used for internal features and .
    // - A0:1 are used for LED push-pull outputs.  They can link to TIM2 in the future.
    // - A2 is the radio shutdown push-pull output
    // - A3 is the radio signal input for RFIO3.  It should be HiZ input or open-drain out.
    // - A4 is the radio SPI CS pin, which is a push-pull output
    // - A5:7 are radio SPI bus, set to ALT.  MISO is pull-down
    // - A8 is the MCO pin, which by default we use as output ground
    // - A9 is  UART TX, which is ALT open-drain output
    // - A10 is  UART RX, which is ALT pullup input
    // - A11 is UART RTS, which is pull-up open drain output by default
    // - A12 is UART CTS, which is pull-up input by default
    // - A13:14 are SWD, which are ALT
    // - A15 is  SRES, which is pull-up input by default
    GPIOA->BSRRL    = BOARD_RFCTL_SDNPIN | BOARD_RFSPI_CSNPIN;
    /*
    GPIOA->MODER    = (GPIO_MODER_OUT << (0*2)) \
                    | (GPIO_MODER_OUT << (1*2)) \
                    | (GPIO_MODER_OUT << (2*2)) \
                    | (GPIO_MODER_IN  << (3*2)) \
                    | (GPIO_MODER_OUT << (4*2)) \
                    | (GPIO_MODER_ALT << (5*2)) \
                    | (GPIO_MODER_ALT << (6*2)) \
                    | (GPIO_MODER_ALT << (7*2)) \
                    | (GPIO_MODER_OUT << (8*2)) \
                    | (GPIO_MODER_ALT << (9*2)) \
                    | (GPIO_MODER_ALT << (10*2)) \
                    | (GPIO_MODER_OUT << (11*2)) \
                    | (GPIO_MODER_IN  << (12*2)) \
                    | (GPIO_MODER_ALT << (13*2)) \
                    | (GPIO_MODER_ALT << (14*2)) \
                    | (GPIO_MODER_IN  << (15*2));
    */
    GPIOA->MODER    = (GPIO_MODER_OUT << (0*2)) \
                    | (GPIO_MODER_OUT << (1*2)) \
                    | (GPIO_MODER_OUT << (2*2)) \
                    | (GPIO_MODER_IN  << (3*2)) \
                    | (GPIO_MODER_OUT << (4*2)) \
                    | (GPIO_MODER_ALT << (5*2)) \
                    | (GPIO_MODER_ALT << (6*2)) \
                    | (GPIO_MODER_ALT << (7*2)) \
                    | (GPIO_MODER_OUT << (8*2)) \
                    | (GPIO_MODER_IN  << (9*2)) \
                    | (GPIO_MODER_IN  << (10*2)) \
                    | (GPIO_MODER_ALT << (11*2)) \
                    | (GPIO_MODER_ALT << (12*2)) \
                    | (GPIO_MODER_ALT << (13*2)) \
                    | (GPIO_MODER_ALT << (14*2)) \
                    | (GPIO_MODER_IN  << (15*2));
    /* */
    
