jpnorair/OpenTag/include/board/stm32l1xx/board_Jupiter_R1.h
    // LED interface: Keep Alive
    // LED usage will impact energy usage tremendously, so don't use LEDs in 
    // low-power apps. 
    
    // MPIPE interface on PB6-7, set to output ground.
#   if (MCU_CONFIG(MPIPEUART) != ENABLED)
        //GPIOB->PUPDR   &= ~(3 << (6*2)) & ~(7 << (6*2));
        //GPIOB->MODER   &= ~(3 << (6*2)) & ~(7 << (6*2));
        //GPIOB->ODR     &= ~(1 << 6) & ~(1 << 7);
#   endif
    
    
    //SPIRIT1 RF Interface, using SPI1 and some GPIOs
    //GPIO0-3 are floating inputs (default), SDN is 2MHz push-pull output
    
    // ground spi pins?
}




///@note BOARD Macro for initializing the STM32 PVD Module (voltage monitor) at
///      startup.  Only relevant for battery-powered boards.
static inline void BOARD_POWER_STARTUP(void) {
#   if (MCU_FEATURE_SVMONITOR == ENABLED)
    // Level0 is 1.9V, each level is +0.2V.  Check your battery spec and change
    // the _LEVx component to match it.  Typical Li-Ion undervoltage is 2.7V.
    PWR->CR    |= PWR_CR_PLS_LEV0 | PWR_CR_PVDE;  
#   endif
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  For any build using CMSIS libraries (standard), this will
///      be blank.  In those cases, crystal init is done in the CMSIS system
///      startup function.
static inline void BOARD_XTAL_STARTUP(void) {
// Currently this is handled in the system startup function.  OpenTag requires
// a 32768Hz clock
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  For any build using CMSIS libraries (standard), this will
///      be blank.  In those cases, crystal init is done in the CMSIS system
///      startup function.
#include <io/spirit1/clkout.h>    // Used for clkout functions

static inline void BOARD_HSXTAL_ON(void) {
    spirit1_clockout_on(b10000110); // 48MHz/6 = 8MHz
}

static inline void BOARD_HSXTAL_OFF(void) {
    spirit1_clockout_off();
}

static inline void BOARD_USBCLK_ON(void) {
    ///@todo configure XTAL port for Bypass
    spirit1_clockout_on(b10000110); // 48MHz/6 = 8MHz
    platform_ext_pllon();
}

static inline void BOARD_USBCLK_OFF(void) {
    platform_ext_plloff();
    spirit1_clockout_off();
}

static inline void BOARD_USB_PORTENABLE(void) {
    BOARD_USBCLK_ON();
    
    //BOARD_USB_PORT->MODER  |= (GPIO_MODER_ALT << (BOARD_USB_DMPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_USB_DPPINNUM*2));
    SYSCFG->PMC |= SYSCFG_PMC_USB_PU;
}

static inline void BOARD_USB_PORTDISABLE(void) {
    SYSCFG->PMC &= ~SYSCFG_PMC_USB_PU;
    //BOARD_USB_PORT->MODER  &= ~( (3 << (BOARD_USB_DMPINNUM*2)) \
                               | (3 << (BOARD_USB_DPPINNUM*2)) );
    BOARD_USBCLK_OFF();
}

   

///@note BOARD Macros for Radio module interrupt vectoring.  Connect these to
///      the radio interface driver you are using.  Check the schematic of your
///      board to see where the Radio IRQ lines are routed.  Also check the 
///      radio interface header documentation (it's really quite simple). 
///      These Macros will get called in the universal EXTI interrupt handler,
///      typically implemented in platform_isr_STM32L.c
#define BOARD_RADIO_EXTI0_ISR()     spirit1_irq0_isr()
#define BOARD_RADIO_EXTI1_ISR()     spirit1_irq1_isr()
#define BOARD_RADIO_EXTI2_ISR()     spirit1_irq2_isr()
#define BOARD_RADIO_EXTI3_ISR();
#define BOARD_RADIO_EXTI4_ISR();
#define BOARD_RADIO_EXTI5_ISR();
#define BOARD_RADIO_EXTI6_ISR();     
#define BOARD_RADIO_EXTI7_ISR();     
#define BOARD_RADIO_EXTI8_ISR();     
#define BOARD_RADIO_EXTI9_ISR();     
#define BOARD_RADIO_EXTI10_ISR();
#define BOARD_RADIO_EXTI11_ISR();
#define BOARD_RADIO_EXTI12_ISR();
#define BOARD_RADIO_EXTI13_ISR();
#define BOARD_RADIO_EXTI14_ISR();
#define BOARD_RADIO_EXTI15_ISR();


///@todo Create a more intelligent setup that knows how to use the UART, even
///      though for this board UART is not generally the MPipe
///@note BOARD Macros for Com module interrupt vectoring.  Connect these to
///      the Com interface driver you are using.  Check the schematic of your
///      board to see where the Com IRQ lines are routed. 
#if (MCU_CONFIG(MPIPEUART) && OT_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE_BREAK))
#   define _UART_RXSYNC_ISR()       mpipe_rxsync_isr()
#else
#   define _UART_RXSYNC_ISR()       ; 
#endif

#define BOARD_COM_EXTI0_ISR();
#define BOARD_COM_EXTI1_ISR();
#define BOARD_COM_EXTI2_ISR();
#define BOARD_COM_EXTI3_ISR();
#define BOARD_COM_EXTI4_ISR();
#define BOARD_COM_EXTI5_ISR();
#define BOARD_COM_EXTI6_ISR();     
#define BOARD_COM_EXTI7_ISR();     
#define BOARD_COM_EXTI8_ISR();     
#define BOARD_COM_EXTI9_ISR();
#define BOARD_COM_EXTI10_ISR()   _UART_RXSYNC_ISR()
#define BOARD_COM_EXTI11_ISR();
#define BOARD_COM_EXTI12_ISR();
#define BOARD_COM_EXTI13_ISR();
#define BOARD_COM_EXTI14_ISR();
#define BOARD_COM_EXTI15_ISR();





/** Note: Clocking for the Board's MCU      <BR>
  * ========================================================================<BR>
  * The STM32L can be clocked up to 32MHz, but generally we use it at 16 MHz.
  * At the 1.5V core setting, 16MHz can be used with 1 flash waitstate, but 
  * OpenTag code tends to abhor branching, so flash wait states have less 
  * affect on OT efficiency than they have on most other codebases.
  */
#define MCU_CONFIG_LFXTALHz          BOARD_PARAM_LFHz
#define MCU_CONFIG_LFXTALtol         BOARD_PARAM_LFtol
//#define MCU_CONFIG_LFOSCHz           BOARD_PARAM_LFHz
//#define MCU_CONFIG_LFOSCtol          BOARD_PARAM_LFtol
//#define MCU_CONFIG_XTALHz            BOARD_PARAM_HFHz
//#define MCU_CONFIG_XTALmult          BOARD_PARAM_HFmult
//#define MCU_CONFIG_XTALtol           BOARD_PARAM_HFtol
#define MCU_CONFIG_OSCHz             BOARD_PARAM_HFHz
#define MCU_CONFIG_OSCmult           BOARD_PARAM_HFmult
#define MCU_CONFIG_OSCtol            BOARD_PARAM_HFtol

#define PLATFORM_MCLK_DIV           BOARD_PARAM_MCLKDIV
#define PLATFORM_SMCLK_DIV          BOARD_PARAM_SMCLKDIV

